<!DOCTYPE html>


  <html class="light page-post">


<head>
  <meta charset="utf-8">
  
  <title>类的内存布局 | Philosopher</title>

  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

  
    <meta name="keywords" content="c++," />
  

  <meta name="description" content="探讨C++中的类的内存布局，对于这个问题，网上可以搜索到很多的文章了。但是自己还是打算测试一下，权当是检验真理。  测试环境  VS2017 (Debug模式下x86)  本文主要是对多继承的测试，首先看一下代码.">
<meta name="keywords" content="c++">
<meta property="og:type" content="article">
<meta property="og:title" content="类的内存布局">
<meta property="og:url" content="http://mrsiz.github.io/2018/04/28/类的内存布局/index.html">
<meta property="og:site_name" content="Philosopher">
<meta property="og:description" content="探讨C++中的类的内存布局，对于这个问题，网上可以搜索到很多的文章了。但是自己还是打算测试一下，权当是检验真理。  测试环境  VS2017 (Debug模式下x86)  本文主要是对多继承的测试，首先看一下代码.">
<meta property="og:updated_time" content="2020-04-21T05:24:07.179Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="类的内存布局">
<meta name="twitter:description" content="探讨C++中的类的内存布局，对于这个问题，网上可以搜索到很多的文章了。但是自己还是打算测试一下，权当是检验真理。  测试环境  VS2017 (Debug模式下x86)  本文主要是对多继承的测试，首先看一下代码.">

  

  
    <link rel="icon" href="/favicon.ico">
  

  <link href="/css/styles.css?v=c114cbeddx" rel="stylesheet">


  
    <link rel="stylesheet" href="/css/personal-style.css">
  

  
<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){

<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br></pre></td><td class="code"><pre><span class="line">class A	size(8):</span><br><span class="line">	+---</span><br><span class="line"> <span class="number">0</span>	| &#123;vfptr&#125;</span><br><span class="line"> <span class="number">4</span>	| a</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">A::$vftable@:</span><br><span class="line">	| &amp;A_meta</span><br><span class="line">	|  <span class="number">0</span></span><br><span class="line"> <span class="number">0</span>	| &amp;A::funcA</span><br><span class="line"></span><br><span class="line">A::funcA <span class="keyword">this</span> adjustor: <span class="number">0</span></span><br><span class="line"></span><br><span class="line">class B	size(20):</span><br><span class="line">	+---</span><br><span class="line"> <span class="number">0</span>	| &#123;vfptr&#125;</span><br><span class="line"> <span class="number">4</span>	| &#123;vbptr&#125;</span><br><span class="line"> <span class="number">8</span>	| b</span><br><span class="line">	+---</span><br><span class="line">	+--- (<span class="keyword">virtual</span> base A)</span><br><span class="line"><span class="number">12</span>	| &#123;vfptr&#125;</span><br><span class="line"><span class="number">16</span>	| a</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">B::$vftable@B@:</span><br><span class="line">	| &amp;B_meta</span><br><span class="line">	|  <span class="number">0</span></span><br><span class="line"> <span class="number">0</span>	| &amp;B::funcB</span><br><span class="line"></span><br><span class="line">B::$vbtable@:</span><br><span class="line"> <span class="number">0</span>	| <span class="number">-4</span></span><br><s