<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8">
    <meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport">
    
    <title>类的内存布局 - Philosopher</title>
    <meta charset="utf-8">
    
    <meta name="title" content="类的内存布局 - Philosopher">
    <meta name="description" content="">
    <meta property="og:image" content="/favicon.png">
    <meta property="og:image:width" content="200" />
    <meta property="og:image:height" content="200" />
    <link rel="shortcut icon" href="/favicon.png">
    
    <link rel="stylesheet"
        href="//cdn.jsdelivr.net/gh/highlightjs/cdn-release@9.17.1/build/styles/arduino-light.min.css">
    <script src="//cdn.jsdelivr.net/gh/highlightjs/cdn-release@9.17.1/build/highlight.min.js"></script>
    <script>hljs.initHighlightingOnLoad();</script>
    
    <link rel="stylesheet" href="/css/style.css">
    <script src="/js/jquery.min.js"></script>
</head>

<body>
    <header class="header">
    <div class="blog-title">
        <a href="/" class="logo">Philosopher</a>
    </div>
    <nav class="navbar">
        <ul class="menu">
            
            
            
            <li class="menu-item">
                
                <a href="/" class="menu-item-link">Home</a>
                
            </li>
            
            
            
            <li class="menu-item">
                
                <a href="/archives" class="menu-item-link">Archives</a>
                
            </li>
            
            
            
            <li class="menu-item">
                
                <a href="/about" class="menu-item-link">About</a>
                
            </li>
            
        </ul>
    </nav>
</header>
    <main class="main">
        <article class="post">
    <div class="post-title">
        <h1 class="title">类的内存布局</h2>
    </div>
    <div class="post-content">
        <p>探讨C++中的类的内存布局，对于这个问题，网上可以搜索到很多的文章了。但是自己还是打算测试一下，权当是检验真理。</p>
<h3 id="测试环境"><a href="#测试环境" class="headerlink" title="测试环境"></a>测试环境</h3><ul>
<li>VS2017 (Debug模式下x86)</li>
</ul>
<p>本文主要是对多继承的测试，首先看一下代码.<br><a id="more"></a><br><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br></pre></td><td class="code"><pre><code class="hljs c++"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">A</span> &#123;</span><br><span class="hljs-keyword">public</span>:<br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">void</span> <span class="hljs-title">funcA</span><span class="hljs-params">()</span> </span>&#123;&#125;<br><span class="hljs-keyword">private</span>:<br>	<span class="hljs-keyword">int</span> a;<br>&#125;;<br><br><br><br><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">B</span> :</span> <span class="hljs-keyword">virtual</span> <span class="hljs-keyword">public</span> A &#123;<br><br><span class="hljs-keyword">public</span>:<br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">void</span> <span class="hljs-title">funcA</span><span class="hljs-params">()</span> </span>&#123;&#125;<br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">void</span> <span class="hljs-title">funcB</span><span class="hljs-params">()</span> </span>&#123;&#125;<br><span class="hljs-keyword">private</span>:<br>	<span class="hljs-keyword">int</span> b;<br>&#125;;<br><br><br><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">C</span> :</span> <span class="hljs-keyword">virtual</span> <span class="hljs-keyword">public</span> A &#123;<br><span class="hljs-keyword">public</span>:<br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">void</span> <span class="hljs-title">funcA</span><span class="hljs-params">()</span> </span>&#123;&#125;<br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">void</span> <span class="hljs-title">funcC</span><span class="hljs-params">()</span> </span>&#123;&#125;<br><span class="hljs-keyword">private</span>:<br>	<span class="hljs-keyword">int</span> c;<br>&#125;;<br><br><br><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">D</span> :</span> <span class="hljs-keyword">public</span> B, <span class="hljs-keyword">public</span> C &#123;<br><span class="hljs-keyword">public</span>:<br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">void</span> <span class="hljs-title">funcA</span><span class="hljs-params">()</span> </span>&#123;&#125;<br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">void</span> <span class="hljs-title">funcD</span><span class="hljs-params">()</span> </span>&#123;&#125;<br><span class="hljs-keyword">private</span>:<br>	<span class="hljs-keyword">int</span> d;<br>&#125;;<br><br><span class="hljs-comment">/*<br>    A<br>   / \<br>  B   C<br>   \ /<br>    D<br>类的继承体系如上，虚继承。<br>*/</span><br><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span><br></span>&#123;<br>	<span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;<br>&#125;<br></code></pre></td></tr></table></figure></p>
<p>在VS中添加编译选项<code>/d1 reportAllClassLayout</code>得到如下的结果：<br><figure class="highlight"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br></pre></td><td class="code"><pre><code class="hljs c++">class A	size(8):<br>	+---<br> 0	| &#123;vfptr&#125;<br> 4	| a<br>	+---<br><br>A::$vftable@:<br>	| &amp;A_meta<br>	|  0<br> 0	| &amp;A::funcA<br><br>A::funcA this adjustor: 0<br><br>class B	size(20):<br>	+---<br> 0	| &#123;vfptr&#125;<br> 4	| &#123;vbptr&#125;<br> 8	| b<br>	+---<br>	+--- (virtual base A)<br>12	| &#123;vfptr&#125;<br>16	| a<br>	+---<br><br>B::$vftable@B@:<br>	| &amp;B_meta<br>	|  0<br> 0	| &amp;B::funcB<br><br>B::$vbtable@:<br> 0	| -4<br> 1	| 8 (Bd(B+4)A)<br><br>B::$vftable@A@:<br>	| -12<br> 0	| &amp;B::funcA<br><br>B::funcA this adjustor: 12<br>B::funcB this adjustor: 0<br>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp<br>               A      12       4       4 0<br><br>class C	size(20):<br>	+---<br> 0	| &#123;vfptr&#125;<br> 4	| &#123;vbptr&#125;<br> 8	| c<br>	+---<br>	+--- (virtual base A)<br>12	| &#123;vfptr&#125;<br>16	| a<br>	+---<br><br>C::$vftable@C@:<br>	| &amp;C_meta<br>	|  0<br> 0	| &amp;C::funcC<br><br>C::$vbtable@:<br> 0	| -4<br> 1	| 8 (Cd(C+4)A)<br><br>C::$vftable@A@:<br>	| -12<br> 0	| &amp;C::funcA<br><br>C::funcA this adjustor: 12<br>C::funcC this adjustor: 0<br>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp<br>               A      12       4       4 0<br><br>class D	size(36):<br>	+---<br> 0	| +--- (base class B)<br> 0	| | &#123;vfptr&#125;<br> 4	| | &#123;vbptr&#125;<br> 8	| | b<br>	| +---<br>12	| +--- (base class C)<br>12	| | &#123;vfptr&#125;<br>16	| | &#123;vbptr&#125;<br>20	| | c<br>	| +---<br>24	| d<br>	+---<br>	+--- (virtual base A)<br>28	| &#123;vfptr&#125;<br>32	| a<br>	+---<br><br>D::$vftable@B@:<br>	| &amp;D_meta<br>	|  0<br> 0	| &amp;B::funcB<br> 1	| &amp;D::funcD<br><br>D::$vftable@C@:<br>	| -12<br> 0	| &amp;C::funcC<br><br>D::$vbtable@B@:<br> 0	| -4<br> 1	| 24 (Dd(B+4)A)<br><br>D::$vbtable@C@:<br> 0	| -4<br> 1	| 12 (Dd(C+4)A)<br><br>D::$vftable@A@:<br>	| -28<br> 0	| &amp;D::funcA<br><br>D::funcA this adjustor: 28<br>D::funcD this adjustor: 0<br>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp<br>               A      28       4       4 0<br></code></pre></td></tr></table></figure></p>
<p>由上可知:</p>
<ol>
<li>存在虚函数的类中都会有vfptr(指向虚函数表)</li>
<li>从虚基类继承的时候，虚基类排在最后面</li>
<li>虚继承利用到了vbptr,若不是虚继承，则会重复包含父类成员</li>
</ol>
<h3 id="其它问题"><a href="#其它问题" class="headerlink" title="其它问题"></a>其它问题</h3><h5 id="1-为什么类B和C有自己的虚函数的时候，会增加一个vfptr-而D有自己的虚函数的时候不会再增加一个vfptr"><a href="#1-为什么类B和C有自己的虚函数的时候，会增加一个vfptr-而D有自己的虚函数的时候不会再增加一个vfptr" class="headerlink" title="1. 为什么类B和C有自己的虚函数的时候，会增加一个vfptr,而D有自己的虚函数的时候不会再增加一个vfptr?"></a>1. 为什么类B和C有自己的虚函数的时候，会增加一个vfptr,而D有自己的虚函数的时候不会再增加一个vfptr?</h5><p>个人理解是因为类会把自己的虚函数加入到第一个vfptr指向的虚函数表中去，因为类B第一个成员不是vfptr,所以编译器自动加了一个vfptr….纯属个人理解。</p>
<h4 id="2-如何直接调用一个虚函数"><a href="#2-如何直接调用一个虚函数" class="headerlink" title="2. 如何直接调用一个虚函数"></a>2. 如何直接调用一个虚函数</h4><p>一个简单示例:<br><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br></pre></td><td class="code"><pre><code class="hljs c++"><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;iostream&gt;</span></span><br><span class="hljs-meta">#<span class="hljs-meta-keyword">include</span> <span class="hljs-meta-string">&lt;cstdlib&gt;</span></span><br><br><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Test</span> &#123;</span><br><span class="hljs-keyword">public</span>:<br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">void</span> <span class="hljs-title">func1</span><span class="hljs-params">()</span> </span>&#123;<br>		<span class="hljs-built_in">std</span>::<span class="hljs-built_in">cout</span> &lt;&lt; <span class="hljs-string">"hello Test\n"</span>;<br>	&#125;<br><br>	<span class="hljs-function"><span class="hljs-keyword">virtual</span> <span class="hljs-keyword">int</span> <span class="hljs-title">func2</span><span class="hljs-params">()</span> </span>&#123;<br>		<span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;<br>	&#125;<br>&#125;;<br><br><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">main</span><span class="hljs-params">()</span><br></span>&#123;<br>	Test a;<br>	<span class="hljs-comment">//通过类型转换获得虚表的地址</span><br>	<span class="hljs-keyword">auto</span> vtable = (<span class="hljs-keyword">intptr_t</span>*)(*(<span class="hljs-keyword">intptr_t</span>*)(&amp;a));<br><br>	<span class="hljs-keyword">auto</span> func1 = (<span class="hljs-keyword">void</span>(*)())vtable[<span class="hljs-number">0</span>];<br>	<span class="hljs-keyword">auto</span> func2 = (<span class="hljs-keyword">int</span>(*)())vtable[<span class="hljs-number">1</span>];<br>	func1();<br>	<span class="hljs-built_in">std</span>::<span class="hljs-built_in">cout</span> &lt;&lt; func2() &lt;&lt; <span class="hljs-built_in">std</span>::<span class="hljs-built_in">endl</span>;<br><br>	system(<span class="hljs-string">"pause"</span>);<br><br>	<span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;<br>&#125;<br></code></pre></td></tr></table></figure></p>
<p>通过直接获得类中的vfptr中的地址，然后再通过类型的转换，获得虚函数表的地址，然后再从虚函数表中获得函数地址，最后调用即可。进行类型转换的原因是因为需要对指针解引用，而指针所指向的类型影响到了解引用时的内存大小，所以需要进行合理地类型转换，否则会出错的。</p>

    </div>
    <div class="post-meta">
        <span class="post-time">2018/04/28</span>
    </div>
</article>

<div class="prev_next">
    <nav id="prev_next">

<div class="prev">
    
    <p>Newer</p>
    <a href="/2018/06/20/linux下编译运行bochs/"><div class="article-nav-title">linux下编译运行bochs</div></a>
    
</div>
<div class="next">
    
    <p>Older</p>
    <a href="/2018/04/13/利用python登录服务器并下载文件/"><div class="article-nav-title">利用python登录服务器并下载文件</div></a>
    
</div>

</nav>
</div>

<div class="post-comment">
    



</div>
    </main>
</body>

</html>